# IFCProperty Mapping Info Dispose Method

Source: https://www.revitapidocs.com/2026/dcffc636-def7-79c1-1c2f-a154ec8ad118.htm

---

| IFCProperty Mapping Info Dispose Method |
| --- |

Releases all resources used by the IFCPropertyMappingInfo
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public void Dispose()
```

```
Public Sub Dispose
```

```
public:
virtual void Dispose() sealed
```

```
abstract Dispose : unit -> unit
override Dispose : unit -> unit
```

#### Implements

IDisposable Dispose
See Also

#### Reference

IFCPropertyMappingInfo Class Autodesk.Revit.DB Namespace